#!/usr/bin/python3
# -*- coding:utf-8 -*-
"""
:author: keane
:file  numpy_demo.py
:time  2023/6/19 15:21
:desc  
"""
import pandas as pd
import numpy as np

# 打印numpy的版本和配置说明
# 创建一个长度为10的空向量
# 找到任何一个数据内存大小
# 从命令行得到numpy中add函数的说明文档
# 创建一个长度为10并且除了第5个值为1的空向量
# 创建一个值域范围从10到49的向量
# 翻转一个向量（第一个元素变为最后一个）
# 创建一个3*3并且值从0到8的矩阵
# 找到数组【1,2,0,0,4,0】中非0元素的位置索引----
# 创建一个3*3的单位矩阵----
# 创建一个3*3*3的随机数组----
# 创建一个10*10的随机数组并找到它的最大值和最小值----
# 创建一个长度为30的随机向量并找到他的平均值
# 创建一个二维数组，其中边界值为1，其余值为0----
# 对于一个已存在的数组，添加一个用0填充的边界----
# 创建一个5*5的矩阵，并设置值1,2,3,4,落在器对角线下方位置 ----
# 创建一个8*8的矩阵，并设置成棋盘样式----
# 一个（6,7,8）形状的数组，其第100个元素的索引（x,y,z）是什么----
# 用tile函数去创建一个8*8的棋盘样式矩阵
# 对一个5*5的随机矩阵做归一化
# 创建一个将颜色描述为（RGBA）四个无符号字节的自定义dtype----
# 一个5*3的矩阵与一个3*2的矩阵相乘，实矩阵乘积是什么----
# 给定一个一维数组对其在3到8之间的所有元素取反----
# 对提供的可迭代对象进行迭代，对值求和----
# 将提供的列表所有值求和----
# 如何从零位对浮点数组做舍入----
# 如何找到两个数组中的共同元素----
# 如何得到昨天，今天，明天的日期----
# 如何得到所有与2016年7月对应的日期---
# 如何直接在位计算（A+B）*（-A/2）[不建立副本]----
# 用五种不同的方法去提取一个随机数组的整数部分----
# 创建一个5*5的矩阵，其中每行的数值范围从0到4----
# 通过考虑一个可生成10个整数的函数，来构建一个数组
# 创建一个长度为10的随机向量，其值域范围从0到1，但是不包括0和1
# 创建一个长度为10的随机向量，并将其排序
# 对于一个小数组，如何比np.sum更快的方式对其求和
# 对于两个随机数组A和B，检查他们是否相等
# 创建一个只读数组（read-only）
# 将笛卡尔坐标下的一个10*2的矩阵转为极坐标形式
# 创建一个长度为10的向量，并将向量中最大值替换为1
# 创建一个结构化数组，并实现x和y坐标覆盖[0,1]~[0,1]
# 给定恋歌数组X和Y，构造Cauchy矩阵C（Cij = 1/(xi-yj)）
# 打印每个numpy标量类型的最小值和最大值
# 如何打印一个数组中的所有数值
# 给定标量时，如何找到数组中最接近标量的值
